dineshannayya/riscduino_firmware/custom_board/riscduino/boards.txt
# allow Clock Frequency selection

menu.clksrc=CPU Clock Frequency
menu.toolsloc=Tool Install Location

riscduino_devkit.name=Riscduino core DevKit
riscduino_devkit.menu.toolsloc.default=Default
riscduino_devkit.menu.toolsloc.manual=Manual
riscduino_devkit.menu.toolsloc.default.compiler.path={runtime.tools.riscv32-unknown-elf-gcc.path}/bin/
riscduino_devkit.menu.toolsloc.manual.compiler.path=

riscduino_devkit.program.tool=rdnodude
riscduino_devkit.upload.tool=rdnodude
riscduino_devkit.upload.tool.default=rdnodude
riscduino_devkit.upload.protocol=riscduino
riscduino_devkit.upload.maximum_size=8388608
riscduino_devkit.upload.maximum_data_size=2048
riscduino_devkit.upload.speed=9600


riscduino_devkit.build.mcu=rv32imac
riscduino_devkit.build.f_cpu=16000000L
riscduino_devkit.build.board=RISCDUINO_DEVKIT
riscduino_devkit.build.core=riscduino
riscduino_devkit.build.variant=standard

# This sets a define for use in the compiled code.
riscduino_devkit.build.boardenv=riscduino
riscduino_devkit.build.sdata.size=4096
riscduino_devkit.build.ldscript={compiler.sdk.path}/env/uncache/link.lds







